lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/i3c_bus/fsl_component_i3c.c
/*
 * Copyright 2020, 2022-2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_component_i3c.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
void I3C_BusSetAddrSlot(i3c_bus_t *bus, uint8_t addr, i3c_addr_slot_status_t status)
{
    uint16_t bitPos = (uint16_t)addr * I3C_BUS_ADDR_SLOTWIDTH;
    uint32_t *slotPtr;

    if (addr > I3C_BUS_MAX_ADDR)
    {
        return;
    }

    slotPtr = &bus->addrSlots[bitPos / I3C_BUS_ADDR_SLOTDEPTH];
    *slotPtr &= ~((uint32_t)I3C_BUS_ADDR_SLOTMASK << (bitPos % I3C_BUS_ADDR_SLOTDEPTH));
    *slotPtr |= (uint32_t)status << (bitPos % I3C_BUS_ADDR_SLOTDEPTH);
}

static void I3C_BusInitAddrSlots(i3c_bus_t *bus)
{
    uint8_t i;

    /* Reserve address 0x0 to 0x7. */
    for (i = 0; i < 8U; i++)
    {
        I3C_BusSetAddrSlot(bus, i, kI3C_Bus_AddrSlot_Reserved);
    }

    /* Reserve the conditional restriction I3C address. */
    I3C_BusSetAddrSlot(bus, 0x78U, kI3C_Bus_AddrSlot_Reserved);
    I3C_BusSetAddrSlot(bus, 0x79U, kI3C_Bus_AddrSlot_Reserved);
    I3C_BusSetAddrSlot(bus, 0x7BU, kI3C_Bus_AddrSlot_Reserved);
    I3C_BusSetAddrSlot(bus, 0x7DU, kI3C_Bus_AddrSlot_Reserved);

    /* All are prohibited since I3C targets will interpret an I3C address header with any of these addresses as a
     * broadcast address with a single-bit error. */
    I3C_BusSetAddrSlot(bus, I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR1, kI3C_Bus_AddrSlot_Reserved);
    I3C_BusSetAddrSlot(bus, I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR2, kI3C_Bus_AddrSlot_Reserved);
    I3C_BusSetAddrSlot(bus, I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR3, kI3C_Bus_AddrSlot_Reserved);
    I3C_BusSetAddrSlot(bus, I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR4, kI3C_Bus_AddrSlot_Reserved);
    I3C_BusSetAddrSlot(bus, I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR5, kI3C_Bus_AddrSlot_Reserved);
    I3C_BusSetAddrSlot(bus, I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR6, kI3C_Bus_AddrSlot_Reserved);
    I3C_BusSetAddrSlot(bus, I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR7, kI3C_Bus_AddrSlot_Reserved);

    /* Reserve I3C broadcast address. */
    I3C_BusSetAddrSlot(bus, I3C_BUS_BROADCAST_ADDR, kI3C_Bus_AddrSlot_Reserved);
}

static uint8_t I3C_BusGetAddrSlotStatus(i3c_bus_t *bus, uint8_t checkAddr)
{
    uint16_t bitPos    = (uint16_t)checkAddr * 2U;
    uint32_t useStatus = 0;

    if (checkAddr > I3C_BUS_MAX_ADDR)
    {
        return (uint8_t)kI3C_Bus_AddrSlot_Reserved;
    }

    useStatus = bus->addrSlots[bitPos / I3C_BUS_ADDR_SLOTDEPTH];
    useStatus >>= bitPos % I3C_BUS_ADDR_SLOTDEPTH;

    return (uint8_t)(useStatus & (uint8_t)I3C_BUS_ADDR_SLOTMASK);
}

static status_t I3C_CheckBusMasterOps(i3c_device_hw_ops_t *ops)
{
    if ((ops == NULL) || (ops->Init == NULL) || (ops->DoI3CTransfer == NULL) || (ops->DoI2CTransfer == NULL) ||
        (ops->TransmitCCC == NULL) || (ops->ProceedDAA == NULL))
    {
        return kStatus_I3CBus_MasterOpsMissing;
    }

    return kStatus_Success;
}

static status_t I3C_BusMasterGetMaxReadLength(i3c_device_t *master, i3c_device_information_t *info)
{
    i3c_ccc_cmd_t getMRLCmd = {0};
    status_t result         = kStatus_Success;

    getMRLCmd.isRead   = true;
    getMRLCmd.cmdId    = I3C_BUS_CCC_GETMRL;
    getMRLCmd.destAddr = info->dynamicAddr;
    getMRLCmd.data     = malloc(3U);
    getMRLCmd.dataSize = 3U;

    /*
     * When the device does not have IBI payload GETMRL only returns 2
     * bytes of data.
     */
    if ((info->bcr & I3C_BUS_DEV_BCR_IBI_PAYLOAD_MASK) == 0U)
    {
        getMRLCmd.dataSize -= 1U;
    }

    result = I3C_BusMasterSendCCC(master, &getMRLCmd);

    uint8_t *pData = getMRLCmd.data;
    if ((info->bcr & I3C_BUS_DEV_BCR_IBI_PAYLOAD_MASK) != 0U)
    {
        info->maxIBILength = pData[2];
    }

    info->maxReadLength = (uint16_t)pData[0] << 8UL | (uint16_t)pData[1];

    free(getMRLCmd.data);

    return result;
}

static status_t I3C_BusMasterGetMaxWriteLength(i3c_device_t *master, i3c_device_information_t *info)
{
    i3c_ccc_cmd_t getMWLCmd = {0};
    status_t result         = kStatus_Success;

    uint16_t writelen;
    getMWLCmd.isRead   = true;
    getMWLCmd.cmdId    = I3C_BUS_CCC_GETMWL;
    getMWLCmd.destAddr = info->dynamicAddr;
    getMWLCmd.data     = &writelen;
    getMWLCmd.dataSize = 2U;

    result = I3C_BusMasterSendCCC(master, &getMWLCmd);

    info->maxWriteLength = writelen;

    return result;
}

static status_t I3C_BusMasterGetHDRCapability(i3c_device_t *master, i3c_device_information_t *info)
{
    i3c_ccc_cmd_t getHDRCapCmd = {0};
    status_t result            = kStatus_Success;

    uint8_t hdrMode;
    getHDRCapCmd.isRead   = true;
    getHDRCapCmd.cmdId    = I3C_BUS_CCC_GETHDRCAP;
    getHDRCapCmd.destAddr = info->dynamicAddr;
    getHDRCapCmd.data     = &hdrMode;
    getHDRCapCmd.dataSize = 1U;

    result = I3C_BusMasterSendCCC(master, &getHDRCapCmd);

    info->hdrMode = hdrMode;

    return result;
}

static status_t I3C_BusMasterGetPID(i3c_device_t *master, i3c_device_information_t *info)
{
    uint8_t pid[6];
    i3c_ccc_cmd_t getPidCmd = {0};
    status_t result         = kStatus_Success;

    getPidCmd.isRead   = true;
    getPidCmd.cmdId    = I3C_BUS_CCC_GETPID;
    getPidCmd.destAddr = info->dynamicAddr;
    getPidCmd.data     = pid;
    getPidCmd.dataSize = 6U;

    result = I3C_BusMasterSendCCC(master, &getPidCmd);

    info->vendorID   = (((uint16_t)pid[0] << 8U | (uint16_t)pid[1]) & 0xFFFEU) >> 1U;
    info->partNumber = ((uint32_t)pid[2] << 24U | (uint32_t)pid[3] << 16U | (uint32_t)pid[4] << 8U | (uint32_t)pid[5]);

    return result;
}

