lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/i3c_bus/fsl_component_i3c.c
    if (I3C_BusGetAddrSlotStatus(i3cBus, i3cDev->info.dynamicAddr) == (uint8_t)kI3C_Bus_AddrSlot_I3CDev)
    {
        masterControlInfo->funcs->RegisterIBI(masterDev, i3cDev->info.dynamicAddr);
    }
    else
    {
        return kStatus_I3CBus_InvalidOps;
    }

    return kStatus_Success;
}
/*!
 * brief Bus master handle in-band-interrupt event.
 *
 * Bus master call this function to handle in-band-interrupt event.
 *
 * param masterDev Pointer to I3C master device.
 * param ibiAddress slave address which requests the IBI.
 * param ibiData Pointer to the ibi data buffer.
 * param payloadSize ibi data buffer size.
 */
status_t I3C_BusMasterHandleIBI(i3c_device_t *masterDev, uint8_t ibiAddress, void *ibiData, uint32_t payloadSize)
{
    i3c_bus_t *i3cBus = masterDev->bus;

    if (masterDev != i3cBus->currentMaster)
    {
        return kStatus_I3CBus_NotCurrentMaster;
    }

    list_element_handle_t listItem;
    list_handle_t i3cDevList = &(i3cBus->i3cDevList);
    i3c_device_t *i3cDev     = NULL;

    for (listItem = i3cDevList->head; listItem != NULL; listItem = listItem->next)
    {
        i3cDev = (i3c_device_t *)(void *)listItem;
        if (i3cDev == masterDev)
        {
            continue;
        }

        if (i3cDev->info.dynamicAddr == ibiAddress)
        {
            break;
        }
    }

    if (i3cDev != NULL)
    {
        assert(i3cDev->ibiInfo != NULL);
        assert(i3cDev->ibiInfo->maxPayloadLength >= payloadSize);
        assert(i3cDev->ibiInfo->ibiHandler != NULL);

        i3cDev->ibiInfo->ibiHandler(i3cDev, ibiData, payloadSize);
    }

    return kStatus_Success;
}

/*!
 * brief Bus master do data transfer to I2C device.
 *
 * Bus master call this function to transfer data to connected I2C device.
 *
 * param masterDev Pointer to I3C master device.
 * param i2cDev Pointer to the I2C device master do transfer.
 * param xfer Pointer to bus transfer.
 */
status_t I3C_BusMasterDoTransferToI2CDev(i3c_device_t *masterDev, i2c_device_t *i2cDev, i3c_bus_transfer_t *xfer)
{
    i3c_bus_t *i3cBus = masterDev->bus;

    if (masterDev != i3cBus->currentMaster)
    {
        return kStatus_I3CBus_NotCurrentMaster;
    }

    status_t result                              = kStatus_Success;
    i3c_device_control_info_t *masterControlInfo = masterDev->devControlInfo;

    if (I3C_BusGetAddrSlotStatus(i3cBus, i2cDev->staticAddr) == (uint8_t)kI3C_Bus_AddrSlot_I2CDev)
    {
        result = masterControlInfo->funcs->DoI2CTransfer(i2cDev, xfer);
    }
    else
    {
        result = kStatus_I3CBus_InvalidOps;
    }

    return result;
}

/*!
 * brief Bus master do data transfer to I3C device.
 *
 * Bus master call this function to transfer data to connected I3C device.
 *
 * param masterDev Pointer to I3C master device.
 * param i3cDev Pointer to the I3C device master do transfer.
 * param xfer Pointer to bus transfer.
 */
status_t I3C_BusMasterDoTransferToI3CDev(i3c_device_t *masterDev, i3c_device_t *i3cDev, i3c_bus_transfer_t *xfer)
{
    i3c_bus_t *i3cBus = masterDev->bus;

    if (masterDev != i3cBus->currentMaster)
    {
        return kStatus_I3CBus_NotCurrentMaster;
    }

    status_t result                              = kStatus_Success;
    i3c_device_control_info_t *masterControlInfo = masterDev->devControlInfo;

    if (I3C_BusGetAddrSlotStatus(i3cBus, i3cDev->info.dynamicAddr) == (uint8_t)kI3C_Bus_AddrSlot_I3CDev)
    {
        result = masterControlInfo->funcs->DoI3CTransfer(i3cDev, xfer);
    }
    else
    {
        result = kStatus_I3CBus_InvalidOps;
    }

    return result;
}

/*!
 * brief Create I2C slave structure on bus.
 *
 * This function will create I2C device bus structure, initialize the slave according to bus characteristics, install
 * device information including static address, lvr and device control information.
 *
 * param i2cDev Pointer to device structure creating as I2C device.
 * param bus Pointer to bus structure.
 * param staticAddr Static address of the I2C device
 * param lvr legacy virtual register value of the device.
 * param devControlInfo Pointer to device control information structure.
 */
status_t I3C_BusI2CSlaveCreate(
    i2c_device_t *i2cDev, i3c_bus_t *bus, uint8_t staticAddr, uint8_t lvr, i2c_device_control_info_t *devControlInfo)
{
    (void)memset(i2cDev, 0, sizeof(*i2cDev));

    i2cDev->bus            = bus;
    i2cDev->staticAddr     = staticAddr;
    i2cDev->lvr            = lvr;
    i2cDev->devControlInfo = devControlInfo;

    i3c_device_t *masterDev = NULL;
    status_t result         = kStatus_Success;

    if (bus != NULL)
    {
        masterDev = (i3c_device_t *)bus->currentMaster;
    }

    if (masterDev != NULL)
    {
        /*Add device to bus i2c device list */
        I3C_BusAddI2CDev(bus, i2cDev);
    }

    if ((devControlInfo != NULL) && (devControlInfo->funcs != NULL) && (devControlInfo->funcs->Init != NULL))
    {
        result = devControlInfo->funcs->Init(i2cDev);
    }

    return result;
}

/*!
 * brief Create I3C slave structure on bus.
 *
 * This function will create I3C device bus structure, initialize the slave according to bus characteristics, install
 * device information and device control information.
 *
 * param i3cDev Pointer to device structure creating as I3C device.
 * param bus Pointer to bus structure.
 * param devInfo Pointer to device information structure
 * param devControlInfo Pointer to device control information structure.
 */
status_t I3C_BusI3CSlaveCreate(i3c_device_t *i3cDev,
                               i3c_bus_t *bus,
                               i3c_device_information_t *devInfo,
                               i3c_device_ibi_info_t *ibiInfo,
                               i3c_device_control_info_t *devControlInfo)
{
    (void)memset(i3cDev, 0, sizeof(*i3cDev));

    i3cDev->bus            = bus;
    i3cDev->ibiInfo        = ibiInfo;
    i3cDev->info           = *devInfo;
    i3cDev->devControlInfo = devControlInfo;
    status_t result        = kStatus_Success;

    i3c_device_t *masterDev = NULL;

    if (bus != NULL)
    {
        masterDev = (i3c_device_t *)bus->currentMaster;
    }

