lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/i3c_bus/fsl_component_i3c.c
    if (masterDev != NULL)
    {
        /*Add device to bus i3c device list */
        I3C_BusAddI3CDev(bus, i3cDev);
    }

    if ((devControlInfo != NULL) && (devControlInfo->funcs != NULL) && (devControlInfo->funcs->Init != NULL))
    {
        result = devControlInfo->funcs->Init(i3cDev);
    }

    return result;
}

/*!
 * brief I3C slave device request Hot Join on bus.
 *
 * param i3cDev Pointer to device structure creating as I3C device.
 */
status_t I3C_BusSlaveRequestHotJoin(i3c_device_t *i3cDev)
{
    status_t result = kStatus_Success;

    if ((i3cDev->devControlInfo != NULL) && (i3cDev->devControlInfo->funcs != NULL) &&
        (i3cDev->devControlInfo->funcs->HotJoin != NULL))
    {
        i3cDev->devControlInfo->funcs->HotJoin(i3cDev);
    }
    else
    {
        result = kStatus_I3CBus_SlaveOpsNotSupported;
    }

    return result;
}

/*!
 * brief I3C slave device request mastership on bus.
 *
 * param i3cDev Pointer to device structure creating as I3C device.
 */
status_t I3C_BusSlaveRequestMasterShip(i3c_device_t *i3cDev)
{
    status_t result = kStatus_Success;

    if ((i3cDev->devControlInfo != NULL) && (i3cDev->devControlInfo->funcs != NULL) &&
        (i3cDev->devControlInfo->funcs->RequestMastership != NULL))
    {
        i3cDev->devControlInfo->funcs->RequestMastership(i3cDev);
    }
    else
    {
        result = kStatus_I3CBus_SlaveOpsNotSupported;
    }

    return result;
}

/*!
 * brief I3C slave request IBI events.
 *
 * param i3cDev Pointer to device structure creating as I3C device.
 * param data Pointer to data buffer to be sent in IBI event.
 * param dataSize data size of IBI data.
 */
status_t I3C_BusSlaveRequestIBI(i3c_device_t *i3cDev, void *data, size_t dataSize)
{
    status_t result = kStatus_Success;

    if ((i3cDev->devControlInfo != NULL) && (i3cDev->devControlInfo->funcs != NULL) &&
        (i3cDev->devControlInfo->funcs->RequestMastership != NULL))
    {
        i3cDev->devControlInfo->funcs->RequestIBI(i3cDev, data, dataSize);
    }
    else
    {
        result = kStatus_I3CBus_SlaveOpsNotSupported;
    }

    return result;
}
